[
    {
        "title": "HTML",
        "description": "Test your knowledge of HTML, the foundational language of the web, with this quiz! HTML, or Hypertext Markup Language, is the backbone of all web pages and is used to structure content on the internet. Whether you're a beginner or an experienced developer, this quiz will challenge your understanding of HTML tags, elements, and attributes.",
        "topic": "programming"
    },
    {
        "title": "CSS",
        "description": "Test your knowledge of CSS, the language used to style web pages, with this quiz! CSS, or Cascading Style Sheets, is used in conjunction with HTML to create visually appealing and engaging web pages. Whether you're a beginner or an experienced developer, this quiz will challenge your understanding of CSS selectors, properties, and values.",
        "topic": "programming"
    },
    {
        "title": "JavaScript",
        "description": "Test your knowledge of JavaScript, the dynamic programming language used to create interactive web pages, with this quiz! JavaScript is a versatile language that can be used for everything from simple form validation to complex web applications. Whether you're a beginner or an experienced developer, this quiz will challenge your understanding of JavaScript syntax, data types, and functions.",
        "topic": "programming"
    },
    {
        "title": "Sass",
        "description": "Test your knowledge of SASS, the preprocessor scripting language that extends CSS, with this quiz! SASS is a powerful tool for writing complex CSS code that is easy to maintain and reuse. Whether you're a beginner or an experienced developer, this quiz will challenge your understanding of SASS syntax, variables, and mixins.",
        "topic": "programming"
    },
    {
        "title": "Population",
        "description": "Test your knowledge of world population with this quiz! Understanding population trends and demographics is essential for understanding the challenges and opportunities facing our planet. Whether you're a student, researcher, or just curious about the world, this quiz will challenge your understanding of global population statistics and trends.",
        "topic": "geography"
    },
    {
        "title": "Flags",
        "description": "Test your knowledge of world flags with this quiz! Flags are an important symbol of national identity and can provide fascinating insights into a country's history and culture. Whether you're a geography buff or just curious about the world, this quiz will challenge your ability to recognize and identify flags from around the globe.  ",
        "topic": "geography"
    }
]
